{
    "head":{
        "pl":["Strony","skończone oraz funkcjonalne projekty stron internetowych"],
        "en":["Websites","finished and functional website designs"]
    },
    "text":[
        {
            "pl":"<p>SiMBronies jest to spis ludności fandomu My Little Pony w Polsce.</p><p>Jako pierwszy i najstarszy projekt, który był moją motywacją do nauki programowania. Pierwornie zbudowany z czystego html-a przeszedł na konsrukcję budowaną asynchronicznie za pomocą js. W wersji finalnej zawierał on zintegrowaną wyszukiwarkę osób, interaktywną mapę i generowane za pomocą elementu canvas statystyki.</p><p>Ciekawostką może być to, że cała strona działała bez użycia jakiejkolwiek biblioteki.</p>",
            "en":"<p>SiMBronies is a census of My Little Pony's fandom in Poland.</p><p> As the first and oldest project that was my motivation to learn programming. Initially built of pure html, it went to the construction built asynchronously using js. In the final version it included an integrated people search engine, an interactive map and statistics generated using the canvas element.</p><p> An interesting fact may be that the whole site has been working without any external libraries.</p>"
        },{
            "pl":"<p>Strona napisana dla studia Thunder Games Entertainment a zarazem pierwsze podejście do języka php. Podobnie jak w poprzednim projekcie, nie zostały użyte cudze biblioteki oraz skrypty.</p>",
            "en":"<p>Site written for the Thunder Games Entertainment studio and the first approach to php language. As in the previous project, no other libraries or scripts were used.</p>"
        },{
            "pl":"<p>RGTeam project to platforma do prowadzenia konkursów dla artystów. Jej celem było przedstawienie prac zgłoszonych do konkursu oraz umożliwienie głosowania między artystami. System automatycznie autoryzował artystę za pomocą danego mu jednorazowego kodu oraz wykluczał zagłosowanie na siebie samego.</p><p><small>[ opis procesu głosowania znajduje się na drugim zdjęciu ]</small></p>",
            "en":"<p>The RGTeam project is a platform for running contests for artists. Its purpose was to present the works submitted for the competition and to allow voting between the artists. The system automatically authorized the artist by using a one-time code and excluded him voting.</p><P><small>[ description of the voting process is in the second picture ]</small></p>"
        }
    ]
}

